content-org/2021/blogs.org
#+seq_todo: TODO DRAFT DONE
#+hugo_base_dir: ../../
#+HUGO_SECTION: blog/2021
#+hugo_front_matter_format: yaml
#+hugo_custom_front_matter: :type post

#+author: rhnvrm
* TODO Setting up Bluetooth HSP/HFP Profiles on Pulseaudio
:PROPERTIES:
:EXPORT_FILE_NAME: bluetooth-hfp-pulseaudio
:EXPORT_DATE: 2021-01-26
:EXPORT_HUGO_CUSTOM_FRONT_MATTER+: :url blog/2021/01/26/bluetooth-hfp-pulseaudio
:END:

It is 2020, and we are going to go into 2021 in just a few days. Yet Linux
machines can't connect to a bluetooth device mic. I was rather surprised by this
when I finally gave in and bought a device early this year and it turned out
that I could only use it as a sink and not a source. You may scoff, this must be
a distro issue. Unfortunately, using the HSP/HFP profiles to use such a device
as a source does not work for any distro at the moment. Also, even if you have
the device A2DP profile working as a sink, you may not have realized that the
quality is not optimal.

I am not going to lie, it was a long journey which spanned months. I tried my
best documenting it.



** What Works
Nothing else works as flawlessly as the patches written by Pali which have been
forked by some users and put onto the AUR.

*** @pali's work
If you are looking for just a simple way I will try to share the steps I used to get this working. This is based on [[https://aur.archlinux.org/packages/pulseaudio-hsphfpd/#comment-780630][rjshrjndrn's comment]] under the AUR package forked by [[https://aur.archlinux.org/packages/pulseaudio-hsphfpd/#comment-780630][SpineEyE]].

1. Uninstall pulseaudio
   #+BEGIN_SRC
sudo pacman -Rd --nodeps pulseaudio
   #+END_SRC

*** Add to exclude packages
#+BEGIN_SRC
# /etc/pacman.conf
IgnorePkg = libpulse
#+END_SRC

** The Drama
** What does not work well
*** ofono and phonesim
*** pipewire

